Community-PIO-CH32V/platform-ch32v/misc/svd/CH32M030.svd
        <register>
          <name>RSTSCKR</name>
          <displayName>RSTSCKR</displayName>
          <description>Control/status register
          (RCC_RSTSCKR)</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x0C000000</resetValue>
          <fields>
            <field>
              <name>LSION</name>
              <description>Internal low speed oscillator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSIRDY</name>
              <description>Internal low speed oscillator ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USBPD0RSTF</name>
              <description>USBPD0 reset flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBPD1RSTF</name>
              <description>USBPD1 reset flag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMVF</name>
              <description>Remove reset flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_AWDRSTF</name>
              <description>ADC analog watchdog reset flag</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PINRSTF</name>
              <description>PIN reset flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORRSTF</name>
              <description>POR/PDR reset flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFTRSTF</name>
              <description>Software reset flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WWDGRSTF</name>
              <description>Window watchdog reset flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPWRRSTF</name>
              <description>Low-power reset flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HBRSTR</name>
          <displayName>HBRSTR</displayName>
          <description>HB reset register(RCC_APHBRSTR)</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>USBFSRST</name>
              <description>USBFS reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>  
            <field>
              <name>USBPD0RST</name>
              <description>USBPD0 reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBPD1RST</name>
              <description>USBPD1 reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPARST</name>
              <description>OPA reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>			
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EXTEN</name>
      <description> Extend configuration</description>
      <groupName>EXTEN</groupName>
      <baseAddress>0x40023800</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EXTEN_CTLR0</name>
          <displayName>EXTEND control register 0</displayName>
          <description>Configure the extended control register 0</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <resetValue>0x00A38040</resetValue>
          <fields> 
            <field>
              <name>LKUPEN</name>
              <description>LOCKUP_Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
            <field>
              <name>LKUPRST</name>
              <description>LOCKUP RESET</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_LOCK</name>
              <description>Control register 0 and register 1 for configuration locking</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBPD0_CC_REF</name>
              <description>USBPD0 CC pin analog reference enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBPD1_CC_REF</name>
              <description>USBPD1 CC pin analog reference enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBPD0_CC_HVT</name>
              <description>USBPD0 CC pin high threshold input mode enabled</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBPD1_CC_HVT</name>
              <description>USBPD1 CC pin high threshold input mode enabled</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBPD0_LVE_T</name>
              <description>CC pin of USBPD0 1.12V output Tr,Tf difference adjustment</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBPD1_LVE_T</name>
              <description>CC pin of USBPD1 1.12V output Tr,Tf difference adjustment</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISRC1_EN</name>
              <description>Source current 1 enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISRC1_SEL</name>
              <description>Source current 1 selection</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISRC2_EN</name>
              <description>Source current 2 enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISRC2_SEL</name>
              <description>Source current 2 selection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>			
          </fields>
        </register>
		<register>
          <name>EXTEN_KEYR</name>
          <displayName>EXTEN_KEYR</displayName>
          <description>Configure unlock register </description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields> 
            <field>
              <name>KEYR</name>
              <description>Control register 0 and register 1 for configuration unlocking</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field> 
          </fields>
        </register>
        <register>
          <name>EXTEN_CTLR1</name>
          <displayName>EXTEND control register 1</displayName>
          <description>Configure the extended control register 1</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields> 
            <field>
              <name>UDP_BUFOE</name>
              <description>UDP pin DAC_BUF output enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
            <field>
              <name>UDP_PCS</name>
              <description>Select pull-up current or pull-down current 
			  built into the UDP pin</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field> 
            <field>
              <name>UDP_PUE</name>
              <description>UPD port DAC and programmable pull-down 
			  and pull-up mode selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_PDE</name>
              <description>UPD port DAC and programmable pull-down 
			  and pull-up mode selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_DAC</name>
              <description>UPD port DAC data/programmable pull-down 
			  resistor and pull-up resistor data</description>
              <bitOffset>5</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_AE</name>
              <description>Enable of the UDP pin buffer/comparator DAC_BUF</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_AI</name>
              <description>Output of the UDP pin comparator DAC_BUF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_RAT</name>
              <description>UDP pin speed selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_IE</name>
              <description>UDP pin is input enabled when acting as a GPIO</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDM_BUFOE</name>
              <description>UDM pin DAC_BUF output enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDM_PCS</name>
              <description>Select pull-up current or pull-down current 
			  built into the UDM pin</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDM_PUE</name>
              <description>UPM port DAC and programmable pull-down 
			  and pull-up mode selection</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDM_PDE</name>
              <description>UPM port DAC and programmable pull-down 
			  and pull-up mode selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDM_DAC</name>
              <description>UPM port DAC data/programmable pull-down 
			  resistor and pull-up resistor data</description>
              <bitOffset>21</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDM_AE</name>
              <description>Enable of the UDM pin buffer/comparator DAC_BUF</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDM_AI</name>
              <description>Output of the UDM pin comparator DAC_BUF</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDM_RAT</name>
              <description>UDM pin speed selection</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDM_IE</name>
              <description>UDM pin is input enabled when acting as a GPIO</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDU_SHRT</name>
              <description>UDP pin and UDM pin are shorted to enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISINK1_CFGR</name>
          <displayName>ISINK1 configuration register</displayName>
          <description>ISINK1 configuration register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x10</size>
          <resetValue>0x0000</resetValue>
          <fields> 
            <field>
              <name>ISINK1_ADJ</name>
              <description>Sink current 1 calibration value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISINK1_DAT</name>
              <description>Sink current 1 programmable data bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>			
          </fields>
        </register>	
        <register>
          <name>ISINK2_CFGR</name>
          <displayName>ISINK2 configuration register</displayName>
          <description>ISINK2 configuration register</description>
          <addressOffset>0x0E</addressOffset>
          <size>0x10</size>
          <resetValue>0x0000</resetValue>
          <fields> 
            <field>
              <name>ISINK2_ADJ</name>
              <description>Sink current 2 calibration value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISINK2_DAT</name>
              <description>Sink current 2 programmable data bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>			
          </fields>
        </register>			
