Community-PIO-CH32V/platform-ch32v/misc/svd/CH32M030.svd
        <register>
            <name>CHCTLR2_Output</name>
            <displayName>CHCTLR2_Output</displayName>
            <description>capture/compare mode register (output
            mode)</description>
            <addressOffset>0x1C</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>OC4CE</name>
                <description>Output compare 4 clear
                enable</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OC4M</name>
                <description>Output compare 4 mode</description>
                <bitOffset>12</bitOffset>
                <bitWidth>3</bitWidth>
            </field>
            <field>
                <name>OC4PE</name>
                <description>Output compare 4 preload
                enable</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OC4FE</name>
                <description>Output compare 4 fast
                enable</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC4S</name>
                <description>Capture/Compare 4
                selection</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>OC3CE</name>
                <description>Output compare 3 clear
                enable</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OC3M</name>
                <description>Output compare 3 mode</description>
                <bitOffset>4</bitOffset>
                <bitWidth>3</bitWidth>
            </field>
            <field>
                <name>OC3PE</name>
                <description>Output compare 3 preload
                enable</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OC3FE</name>
                <description>Output compare 3 fast
                enable</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC3S</name>
                <description>Capture/Compare 3
                selection</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CHCTLR2_Input</name>
            <displayName>CHCTLR2_Input</displayName>
            <description>capture/compare mode register 2 (input
            mode)</description>
            <alternateRegister>CHCTLR2_Output</alternateRegister>
            <addressOffset>0x1C</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>IC4F</name>
                <description>Input capture 4 filter</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
            </field>
            <field>
                <name>IC4PSC</name>
                <description>Input capture 4 prescaler</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>CC4S</name>
                <description>Capture/compare 4
                selection</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>IC3F</name>
                <description>Input capture 3 filter</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
            </field>
            <field>
                <name>IC3PSC</name>
                <description>Input capture 3 prescaler</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>CC3S</name>
                <description>Capture/compare 3
                selection</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CCER</name>
            <displayName>CCER</displayName>
            <description>capture/compare enable
            register</description>
            <addressOffset>0x20</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CC4P</name>
                <description>Capture/Compare 4 output
                Polarity</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC4E</name>
                <description>Capture/Compare 4 output
                enable</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC3NP</name>
                <description>Capture/Compare 3 output
                Polarity</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC3NE</name>
                <description>Capture/Compare 3 complementary output
                enable</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC3P</name>
                <description>Capture/Compare 3 output
                Polarity</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC3E</name>
                <description>Capture/Compare 3 output
                enable</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC2NP</name>
                <description>Capture/Compare 2 output
                Polarity</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC2NE</name>
                <description>Capture/Compare 2 complementary output
                enable</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC2P</name>
                <description>Capture/Compare 2 output
                Polarity</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC2E</name>
                <description>Capture/Compare 2 output
                enable</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC1NP</name>
                <description>Capture/Compare 1 output
                Polarity</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC1NE</name>
                <description>Capture/Compare 1 complementary output
                enable</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC1P</name>
                <description>Capture/Compare 1 output
                Polarity</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC1E</name>
                <description>Capture/Compare 1 output
                enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CNT</name>
            <displayName>CNT</displayName>
            <description>counter</description>
            <addressOffset>0x24</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CNT</name>
                <description>counter value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>PSC</name>
            <displayName>PSC</displayName>
            <description>prescaler</description>
            <addressOffset>0x28</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>PSC</name>
                <description>Prescaler value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>ATRLR</name>
            <displayName>ATRLR</displayName>
            <description>auto-reload register</description>
            <addressOffset>0x2C</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <resetValue>0xFFFF</resetValue>
            <fields>
            <field>
                <name>ARR</name>
                <description>Auto-reload value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>RPTCR</name>
            <displayName>RPTCR</displayName>
            <description>repetition counter register</description>
            <addressOffset>0x30</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>REP</name>
                <description>Repetition counter value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CH1CVR</name>
            <displayName>CH1CVR</displayName>
            <description>capture/compare register 1</description>
            <addressOffset>0x34</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CH1CVR</name>
                <description>Capture/Compare 1 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>LEVEL1</name>
              <description>Level indicating bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CH2CVR</name>
            <displayName>CH2CVR</displayName>
            <description>capture/compare register 2</description>
            <addressOffset>0x38</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CH2CVR</name>
                <description>Capture/Compare 2 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>LEVEL2</name>
              <description>Level indicating bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CH3CVR</name>
            <displayName>CH3CVR</displayName>
            <description>capture/compare register 3</description>
            <addressOffset>0x3C</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CH3CVR</name>
                <description>Capture/Compare value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>LEVEL3</name>
              <description>Level indicating bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CH4CVR</name>
            <displayName>CH4CVR</displayName>
            <description>capture/compare register 4</description>
            <addressOffset>0x40</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CH4CVR</name>
                <description>Capture/Compare value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>LEVEL4</name>
              <description>Level indicating bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>BDTR</name>
            <displayName>BDTR</displayName>
            <description>break and dead-time register</description>
            <addressOffset>0x44</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>MOE</name>
                <description>Main output enable</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>AOE</name>
                <description>Automatic output enable</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>BKP</name>
                <description>Break polarity</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>BKE</name>
                <description>Break enable</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OSSR</name>
                <description>Off-state selection for Run
                mode</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OSSI</name>
                <description>Off-state selection for Idle
                mode</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>LOCK</name>
                <description>Lock configuration</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>DTG</name>
                <description>Dead-time generator setup</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>DMACFGR</name>
            <displayName>DMACFGR</displayName>
            <description>DMA control register</description>
            <addressOffset>0x48</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>DBL</name>
                <description>DMA burst length</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
            </field>
            <field>
                <name>DBA</name>
                <description>DMA base address</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>DMAR</name>
            <displayName>DMAADR</displayName>
            <description>DMA address for full transfer</description>
            <addressOffset>0x4C</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>DMAB</name>
                <description>DMA register for burst
                accesses</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            </fields>
        </register>
        <register>
          <name>AUX1</name>
          <displayName>AUX</displayName>
          <description>Auxiliary configuration register 1</description>
          <addressOffset>0x50</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>CAP_ED_CH2</name>
              <description>Double-side egde capture is enable for channel2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAP_ED_CH3</name>
              <description>Double-side egde capture is enable for channel3</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAP_ED_CH4</name>
              <description>Double-side egde capture is enable for channel4</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CMS_SPEC</name>
                <description>center-symmetric mode moves down to the function</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OC5PE</name>
                <description>compare register 5 preload
                enable</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OC6PE</name>
                <description>compare register 6 preload
                enable</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OC7PE</name>
                <description>compare register 7 preload
                enable</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OC8PE</name>
                <description>compare register 8 preload
                enable</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC5DE</name>
                <description>Enable DMA request for compare channel 5 </description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>ADC_CAP</name>
                <description>capture the ADC module signal edge function enabled</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC1N_SPEC_EN</name>
                <description>channel 1 complementary channel outputs independent
				PWM function enabled in the edge aligned mode</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC2N_SPEC_EN</name>
                <description>channel 2 complementary channel outputs independent
				PWM function enabled in the edge aligned mode</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC3N_SPEC_EN</name>
                <description>channel 3 complementary channel outputs independent
				PWM function enabled in the edge aligned mode</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>HSCK_MODE</name>
                <description>counter clock is selected to enable the PLL clock</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
