Community-PIO-CH32V/platform-ch32v/misc/svd/CH32M030.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>TIM3</name>
        <description>Streamlined Timer</description>
        <groupName>TIM3</groupName>
        <baseAddress>0x40000400</baseAddress>
        <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        </addressBlock>
        <interrupt>
        <name>TIM3</name>
        <description>TIM3 global interrupt</description>
        <value>43</value>
        </interrupt>
        <registers>
        <register>
            <name>CTLR1</name>
            <displayName>CTLR1</displayName>
            <description>control register 1</description>
            <addressOffset>0x0</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CAPLVL</name>
                <description>Timer capture level indication
                enable</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CAPOV</name>
                <description>Timer capture value configuration
                enable</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CO2NE</name>
                <description>complementary output with dead zone 
                enabled</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CO1NE</name>
                <description>complementary output with dead zone 
                enabled</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CKD</name>
                <description>Clock division</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>ARPE</name>
                <description>Auto-reload preload enable</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OPM</name>
                <description>One-pulse mode</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>URS</name>
                <description>Update request source</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>UDIS</name>
                <description>Update disable</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CEN</name>
                <description>Counter enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>SMCFGR</name>
            <displayName>SMCFGR</displayName>
            <description>slave mode control register</description>
            <addressOffset>0x8</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>DT2</name>
                <description>TIMER3 channel2 dead-time setting</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>DT1</name>
              <description>TIMER3 channel1 dead-time setting</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>TS</name>
              <description>Trigger selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMS</name>
              <description>Slave mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            </fields>
        </register>
        <register>
          <name>DMAINTENR</name>
          <displayName>DMAINTENR</displayName>
          <description>DMA/Interrupt enable register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
                <name>TDE</name>
                <description>Trigger DMA request enable</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CCDS</name>
                <description>Capture/compare DMA
                selection</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC2DE</name>
                <description>Capture/Compare 2 DMA request
                enable</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC1DE</name>
                <description>Capture/Compare 1 DMA request
                enable</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>UDE</name>
                <description>Update DMA request enable</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIE</name>
              <description>Trigger interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2IE</name>
              <description>Capture/Compare 2 interrupt
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1IE</name>
              <description>Capture/Compare 1 interrupt
              enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UIE</name>
              <description>Update interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFR</name>
          <displayName>INTFR</displayName>
          <description>status register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>CC2OF</name>
              <description>Capture/compare 2 overcapture
              flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1OF</name>
              <description>Capture/Compare 1 overcapture
              flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIF</name>
              <description>Trigger interrupt flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2IF</name>
              <description>Capture/Compare 2 interrupt
              flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1IF</name>
              <description>Capture/compare 1 interrupt
              flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UIF</name>
              <description>Update interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
            <name>SWEVGR</name>
            <displayName>SWEVGR</displayName>
            <description>event generation register</description>
            <addressOffset>0x14</addressOffset>
            <size>0x10</size>
            <access>write-only</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>TG</name>
                <description>Trigger generation</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC2G</name>
                <description>Capture/compare 2
                generation</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC1G</name>
                <description>Capture/compare 1
                generation</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>UG</name>
                <description>Update generation</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CHCTLR1_Output</name>
            <displayName>CHCTLR1_Output</displayName>
            <description>capture/compare mode register 1 (output
            mode)</description>
            <addressOffset>0x18</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>OC2M</name>
                <description>Output compare channel 2 mode</description>
                <bitOffset>12</bitOffset>
                <bitWidth>3</bitWidth>
            </field>
            <field>
                <name>OC2PE</name>
                <description>Compare capture register 1 preload
                enable</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OC2FE</name>
                <description>Output compare channel 2 fast
                enable</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC2S</name>
                <description>Capture/Compare channel 2 input 
                selection</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>OC1M</name>
                <description>Output compare 1 mode</description>
                <bitOffset>4</bitOffset>
                <bitWidth>3</bitWidth>
            </field>
            <field>
                <name>OC1PE</name>
                <description>Output compare 1 preload
                enable</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>OC1FE</name>
                <description>Output compare 1 fast
                enable</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>CC1S</name>
                <description>Capture/Compare 1
                selection</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CHCTLR1_Input</name>
            <displayName>CHCTLR1_Input</displayName>
            <description>capture/compare mode register 1 (input
            mode)</description>
            <alternateRegister>CHCTLR1_Output</alternateRegister>
            <addressOffset>0x18</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>IC2F</name>
                <description>Input capture 2 filter</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
            </field>
            <field>
                <name>IC2PSC</name>
                <description>Input capture 2 prescaler</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>CC2S</name>
                <description>Capture/compare 2
                selection</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>IC1F</name>
                <description>Input capture 1 filter</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
            </field>
            <field>
                <name>IC1PSC</name>
                <description>Input capture 1 prescaler</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            <field>
                <name>CC1S</name>
                <description>Capture/Compare 1
                selection</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
            </field>
            </fields>
        </register>
        <register>
          <name>CCER</name>
          <displayName>CCER</displayName>
          <description>capture/compare enable
          register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
                <name>HSCK_MODE</name>
                <description>counter clock is selected to enable the PLL clock</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DT_DIV</name>
              <description>dead-time counts clock frequency division</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
                <name>ADC_CAP</name>
                <description>capture the ADC module signal edge function enabled</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAP_ED</name>
              <description>Double-side egde capture is enable for channel2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2NP</name>
              <description>Channel2 cpmplementary output
              Polarity setting</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1NP</name>
              <description>Channel1 cpmplementary output
              Polarity setting</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CO2P</name>
              <description>Channel2 output Polarity setting</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CO1P</name>
              <description>Channel2 output Polarity setting</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2P</name>
              <description>Capture/Compare 2 output
              Polarity</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2E</name>
              <description>Capture/Compare 2 output
              enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1P</name>
              <description>Capture/Compare 1 output
              Polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1E</name>
              <description>Capture/Compare 1 output
              enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
            <name>CNT</name>
            <displayName>CNT</displayName>
            <description>counter</description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CNT</name>
                <description>counter value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>PSC</name>
            <displayName>PSC</displayName>
            <description>prescaler</description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>PSC</name>
                <description>Prescaler value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>ATRLR</name>
            <displayName>ATRLR</displayName>
            <description>auto-reload register</description>
            <addressOffset>0x2C</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0xffff</resetValue>
            <fields>
            <field>
                <name>ATRLR</name>
                <description>Auto-reload value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CH1CVR</name>
            <displayName>CH1CVR</displayName>
            <description>capture/compare register 1</description>
            <addressOffset>0x34</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CH1CVR</name>
                <description>Capture/Compare 1 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>LEVEL1</name>
              <description>Level indicating bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            </fields>
        </register>
        <register>
            <name>CH2CVR</name>
            <displayName>CH2CVR</displayName>
            <description>capture/compare register 2</description>
            <addressOffset>0x38</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <fields>
            <field>
                <name>CH2CVR</name>
                <description>Capture/Compare 2 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>LEVEL2</name>
              <description>Level indicating bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            </fields>
        </register>
