Community-PIO-CH32V/platform-ch32v/misc/svd/CH32M030.svd
        <register>
          <name>RSQR3</name>
          <displayName>RSQR3</displayName>
          <description>regular sequence register 3</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SQ6</name>
              <description>6th conversion in regular
              sequence</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ5</name>
              <description>5th conversion in regular
              sequence</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ4</name>
              <description>4th conversion in regular
              sequence</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ3</name>
              <description>3rd conversion in regular
              sequence</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ2</name>
              <description>2nd conversion in regular
              sequence</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ1</name>
              <description>1st conversion in regular
              sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISQR</name>
          <displayName>ISQR</displayName>
          <description>injected sequence register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JL</name>
              <description>Injected sequence length</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>JSQ4</name>
              <description>4th conversion in injected
              sequence</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ3</name>
              <description>3rd conversion in injected
              sequence</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ2</name>
              <description>2nd conversion in injected
              sequence</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ1</name>
              <description>1st conversion in injected
              sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATAR1</name>
          <displayName>IDATAR1</displayName>
          <description>injected data register 1</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATA</name>
              <description>Injected data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATAR2</name>
          <displayName>JDATAR2</displayName>
          <description>injected data register 2</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATA</name>
              <description>Injected data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATAR3</name>
          <displayName>IDATAR3</displayName>
          <description>injected data register 3</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATA</name>
              <description>Injected data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATAR4</name>
          <displayName>IDATAR4</displayName>
          <description>injected data register 4</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATA</name>
              <description>Injected data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDATAR</name>
          <displayName>RDATAR</displayName>
          <description>regular data register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
			<field>
              <name>REGU_CH</name>
              <description>Channel order indication</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
			<field>
              <name>DATA</name>
              <description>Regular data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
            <name>CTLR3</name>
            <displayName>CTLR3</displayName>
            <description>ADC Control register 3</description>
            <addressOffset>0x50</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RDR_POLL</name>
                <description>The polling saving function of the rule channel data was enabled</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CMP_XOR_MODE</name>
                <description>comparison result the OXR mode is enabled</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>AVG_DNFIE</name>
                <description>Conversion value underflow interrupt enable</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>AVG_OVFIE</name>
                <description>Conversion value overflow interrupt enable</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>AVG_EN</name>
                <description>The moving average function was enabled</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>AVG_K</name>
                <description>Sliding average window value setting</description>
                <bitOffset>20</bitOffset>
                <bitWidth>3</bitWidth>
              </field>
              <field>
                <name>DNF</name>
                <description>Conversion value underflow flag bit</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>OVF</name>
                <description>Conversion value overflow flag bit</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>DNFIF</name>
                <description>Conversion value underflow interrupt flag bit</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>OVFIF</name>
                <description>Conversion value overflow interrupt flag bit</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>AWD2_RES</name>
                <description>Analog Watchdog 2 compares the results</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>AWD1_RES</name>
                <description>Analog Watchdog 1 compares the results</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
              </field>			  
              <field>
                <name>AWD0_RES</name>
                <description>Analog Watchdog 0 compares the results</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CH_SAVE</name>
                <description>Rule data channel indicates function enable bit</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
              </field>			  
              <field>
                <name>AWD2_RST_EN</name>
                <description>Analog Watchdog 2 reset enable bit</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>AWD1_RST_EN</name>
                <description>Analog Watchdog 1 reset enable bit</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
              </field>			  
              <field>
                <name>AWD0_RST_EN</name>
                <description>Analog Watchdog 0 reset enable bit</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>AWD_SCAN</name>
                <description>Analog Watchdog sans the enable</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>SW_DIS</name>
                <description>ADC channel switchover function in advance was enabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>			  
            </fields>
          </register>
        <register>
          <name>WDTR1</name>
          <displayName>WDTR1</displayName>
          <description>ADC watchdog 1 threshold register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFF0000</resetValue>
          <fields>
            <field>
              <name>HTR1</name>
              <description>Analog watchdog higher threshold setting value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>LTR1</name>
              <description>Analog watchdog lower threshold setting value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTR2</name>
          <displayName>WDTR2</displayName>
          <description>ADC watchdog 2 threshold register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFF0000</resetValue>
          <fields>
            <field>
              <name>HTR2</name>
              <description>Analog watchdog higher threshold setting value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>LTR2</name>
              <description>Analog watchdog lower threshold setting value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AVG_TR</name>
          <displayName>ADC_AVG_TR</displayName>
          <description>ADC average threshold register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFF0000</resetValue>
          <fields>
            <field>
              <name>HTR</name>
              <description>higher average threshold setting value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>LTR</name>
              <description>lower average threshold setting value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
            <name>DLYR</name>
            <displayName>DLYR</displayName>
            <description>delay data register</description>
            <addressOffset>0x60</addressOffset>
            <size>0x20</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DLYVLU</name>
                <description>External trigger data delay time configuration</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
              </field>
              <field>
                <name>DLYSRC</name>
                <description>External trigger source delay selection</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
        <register>
            <name>AVG_DR</name>
            <displayName>ADC_AVG_DR</displayName>
            <description>ADC average data register</description>
            <addressOffset>0x64</addressOffset>
            <size>0x20</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>AVG_DR</name>
                <description>ADC moving average</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
              </field>
            </fields>
          </register>
        <register>
          <name>RDATAR2</name>
          <displayName>RDATAR2</displayName>
          <description>regular data register 2</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
			<field>
              <name>DATA</name>
              <description>Regular data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDATAR3</name>
          <displayName>RDATAR3</displayName>
          <description>regular data register 3</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
			<field>
              <name>DATA</name>
              <description>Regular data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDATAR4</name>
          <displayName>RDATAR4</displayName>
          <description>regular data register 4</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
			<field>
              <name>DATA</name>
              <description>Regular data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
