Community-PIO-CH32V/platform-ch32v/misc/svd/CH32M030.svd
			</registers>
	</peripheral>	
    <peripheral>
      <name>USBPD0</name>
      <description> USBPD configuration</description>
      <groupName>USBPD</groupName>
      <baseAddress>0x40024000</baseAddress>
       <interrupt>
        <name>USBPD0WakeUP</name>
        <description>USBPD0 WakeUP global interrupt</description>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>USBPD0</name>
        <description>USBPD global interrupt</description>
        <value>39</value>
      </interrupt>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3FF</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CONFIG</name>
          <displayName>CONFIG</displayName>
		  <description>PD interrupt enable register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x10</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>CC_FILTER_EN</name>
              <description>PIN filtering enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_ALL_CLR</name>
              <description>PD ITClear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC_SEL</name>
              <description>PD Commutation port</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_DMA_EN</name>
              <description>PD DMA Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_RST_EN</name>
              <description>PD RST Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKE_POLAR</name>
              <description>wakeup polarity</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_MULTI_0</name>
              <description>Several consecutive 0 indicator bits are received</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IE_PD_IO</name>
              <description>IO Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IE_RX_BIT</name>
              <description>bit interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IE_RX_BYTE</name>
              <description>Receive byte register</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IE_RX_ACT</name>
              <description>Receive complete register</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IE_RX_RESET</name>
              <description>Receive complete rst register</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IE_TX_END</name>
              <description>transfer complete register</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BMC_CLK_CNT</name>
          <displayName>BMC_CLK_CNT</displayName>
		  <description>BMC sampling clock counter</description>
          <addressOffset>0x02</addressOffset>
          <size>0x10</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>BMC_CLK_CNT</name>
              <description>R/T counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTROL</name>
          <displayName>CONTROL</displayName>
		  <description>PD Send and receive enable register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PD_TX_EN</name>
              <description>PD_TX_EN value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BMC_START</name>
              <description>BMC_START value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_START</name>
              <description>PD receive status identification</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA_FLAG</name>
              <description>DATA_FLAG value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_BIT_BACK</name>
              <description>TX_BIT_BACK value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BMC_BYTE_HI</name>
              <description>BMC_BYTE_HI value</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_SEL</name>
          <displayName>TX_SEL</displayName>
		  <description>SOP port selection register</description>
          <addressOffset>0x5</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>TX_SEL1</name>
              <description>K-CODE1 type selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_SEL2</name>
              <description>K-CODE2 type selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_SEL3</name>
              <description>K-CODE3 type selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_SEL4</name>
              <description>K-CODE4 type selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BMC_TX_SZ</name>
          <displayName>BMC_TX_SZ</displayName>
		  <description>PD send length register</description>
          <addressOffset>0x6</addressOffset>
          <size>0x10</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>BMC_TX_SZ</name>
              <description>BMC_TX_SZ value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>      
        <register>
          <name>DATA_BUF</name>
          <displayName>DATA_BUF</displayName>
		  <description>DMA cache data register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>DATA_BUF</name>
              <description>DATA_BUF value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <displayName>STATUS</displayName>
		  <description>PD interrupt flag register</description>
          <addressOffset>0x9</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>BMC_AUX</name>
              <description>BMC_AUX value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUF_ERR</name>
              <description>BUF_ERR value</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IF_RX_BIT</name>
              <description>IF_RX_BIT value</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IF_RX_BYTE</name>
              <description>IF_RX_BYTE value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IF_RX_ACT</name>
              <description>IF_RX_ACT value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IF_RX_RESET</name>
              <description>IF_RX_RESET value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IF_TX_END</name>
              <description>IF_TX_END value</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BMC_BYTE_CNT</name>
          <displayName>BMC_BYTE_CNT</displayName>
		  <description>Byte counter</description>
          <addressOffset>0xA</addressOffset>
          <size>0x10</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>BMC_BYTE_CNT</name>
              <description>BMC_BYTE_CNT value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PORT_CC1</name>
          <displayName>PORT_CC1</displayName>
		  <description>CC1 port control register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x08</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>CC1_CMP0</name>
              <description>CC1 output of the voltage comparator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CC1_PD</name>
              <description>CC1 port pull-down resistor enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1_PU</name>
              <description>CC1 port pull-up current selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1_LVE</name>
              <description>CC1 port output of the low voltage</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1_CVS</name>
              <description>CC1 voltage comparator reference voltage</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1_CE</name>
              <description>CC1 voltage comparator enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PORT_CC2</name>
          <displayName>PORT_CC2</displayName>
		  <description>CC2 port control register</description>
          <addressOffset>0xE</addressOffset>
          <size>0x08</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>CC2_CMP0</name>
              <description>CC2 output of the voltage comparator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CC2_PD</name>
              <description>CC2 port pull-down resistor enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC2_PU</name>
              <description>CC2 port pull-up current selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC2_LVE</name>
              <description>CC2 port output of the low voltage</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC2_CVS</name>
              <description>CC2 voltage comparator reference voltage</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC2_CE</name>
              <description>CC2 voltage comparator enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA</name>
          <displayName>DMA</displayName>
		  <description>PD buffer start address register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x10</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>USBPD_DMA_ADDR</name>
              <description>USBPD_DMA_ADDR value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
