Community-PIO-CH32V/platform-ch32v/misc/svd/CH32M030.svd
		</registers>
	</peripheral>
    <peripheral>
        <name>OPA</name>
        <description>OPA_CMP</description>
        <groupName>OPA_CMP</groupName>
        <baseAddress>0x40024800</baseAddress>
        <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
        </addressBlock>
        <interrupt>
        <name>OPA</name>
        <description>OPA and CMP global interrupt</description>
        <value>17</value>
        </interrupt>
        <registers>		
        <register>
        <name>QII_CFGR</name>
        <displayName>CFGR</displayName>
        <description>OPA_CMP_QII configuration register</description>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <resetValue>0x00000000</resetValue>
        <fields>
        <field>
            <name>QII1_AE</name>
            <description>QII1_CMP enable</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
        </field>
        <field>
            <name>QII1_HYPSEL</name>
            <description>QII1_CMP hysteresis selection</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
        </field>		
        <field>
            <name>QII1_AVSEL</name>
            <description>QII1_OPA gain selection</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
        </field>		
        <field>
            <name>QII2_AE</name>
            <description>QII2_CMP enable</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
        </field>
        <field>
            <name>QII2_OPAEN</name>
            <description>QII2_OPA enable</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
        </field>
        <field>
            <name>QII2_SESEL</name>
            <description>QII2 single end amplification mode selection</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
        </field>
        <field>
            <name>QII2_AVSEL</name>
            <description>QII2_OPA gain selection</description>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
        </field>
        <field>
            <name>QII2_HYPSEL</name>
            <description>QII2_CMP hysteresis selection</description>
            <bitOffset>8</bitOffset>
            <bitWidth>3</bitWidth>
            <access>read-write</access>
        </field>
        <field>
            <name>QII2_DACEN</name>
            <description>QII2_DAC enable</description>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
        </field>
        <field>
            <name>QII2_DAC</name>
            <description>QII2_DAC output voltage selection</description>
            <bitOffset>13</bitOffset>
            <bitWidth>4</bitWidth>
            <access>read-write</access>
        </field>
        <field>
            <name>QII2_CHNSEL</name>
            <description>Input selection at the negative end of the QII2_CMP</description>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
        </field>
        <field>
            <name>QII2_CHPSEL</name>
            <description>Input selection at the positive end of the QII2_CMP</description>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
        </field>
          </fields>
        </register> 
        <register>
          <name>ISP_CTLR</name>
          <displayName>ISP_OPA_CMP control</displayName>
          <description>ISP control register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISP1_EN</name>
              <description>ISP1 module enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
			<access>read-write</access>
            </field>
            <field>
              <name>ISP1_GAIN</name>
              <description>ISP1_OPA gain selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
			<access>read-write</access>
            </field>			
            <field>
              <name>ISP1_VFBIAS</name>
              <description>ISP1 module reference voltage selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
			<access>read-write</access>
            </field>			
			<field>
				<name>ISP1_NSEL</name>
				<description>Input selection at the negative end of the ISP1</description>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
           </field>			
			<field>
				<name>ISP1_SEL_IO</name>
				<description>The switch ISP1 module outputs to the ADC</description>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
           </field>	
			<field>
				<name>QDET1_EN</name>
				<description>ISP1 module Q value detection enabled</description>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
           </field>
			<field>
				<name>QDET1_PD30K</name>
				<description>The Q value of the ISP1 module detects the 30K resistance enabled</description>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
           </field>
			<field>
				<name>QDET1_VBSEL</name>
				<description>The ISP1 module Q value detects the reference voltage enabled</description>
				<bitOffset>8</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
           </field>	
            <field>
              <name>ISP2_EN</name>
              <description>ISP2 module enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
			<access>read-write</access>
            </field>
            <field>
              <name>ISP2_GAIN</name>
              <description>ISP2_OPA gain selection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
			<access>read-write</access>
            </field>			
            <field>
              <name>ISP2_VFBIAS</name>
              <description>ISP2 module reference voltage selection</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
			<access>read-write</access>
            </field>			
			<field>
				<name>ISP2_NSEL</name>
				<description>Input selection at the negative end of the ISP2</description>
				<bitOffset>20</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
           </field>			
			<field>
				<name>ISP2_SEL_IO</name>
				<description>The switch ISP2 module outputs to the ADC</description>
				<bitOffset>21</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
           </field>	
			<field>
				<name>QDET2_EN</name>
				<description>ISP2 module Q value detection enabled</description>
				<bitOffset>22</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
           </field>
			<field>
				<name>QDET2_PD30K</name>
				<description>The Q value of the ISP2 module detects the 30K resistance enabled</description>
				<bitOffset>23</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
           </field>
			<field>
				<name>QDET2_VBSEL</name>
				<description>The ISP2 module Q value detects the reference voltage enabled</description>
				<bitOffset>24</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
           </field>   
          </fields>
        </register>
        <register>
          <name>CMP_CTLR</name>
          <displayName>CMP_CTLR</displayName>
          <description>CMP1_2_3 control register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP1_FILT_EN</name>
              <description>CMP1 output digital filtering function was enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP1_FILT_CFG</name>
              <description>CMP1 output digital filter length configuration</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP2_FILT_EN</name>
              <description>CMP2 output digital filtering function was enabled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP2_FILT_CFG</name>
              <description>CMP2 output digital filter length configuration</description>
              <bitOffset>7</bitOffset>
              <bitWidth>5</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP2_BK_EN</name>
              <description>Enable CMP2 output connect to timer 1 brake input</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP2_INT_EN</name>
              <description>Enable CMP2 output interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP3_TRG_SRC</name>
              <description>CMP3 hardware trigger source selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP3_TRG_GATE</name>
              <description>CMP3 hardware trigger channel switching</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>QII_CAP_EN</name>
              <description>The QII output is sent internally directly to the TIM3 capture enable bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP3_COM_MODE</name>
              <description>CMP3 continues comparison mode is enabled</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP3_FILT_EN</name>
              <description>CMP3 output digital filtering function was enabled</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP3_FILT_CFG</name>
              <description>CMP3 output digital filter length configuration</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP3_BK_EN</name>
              <description>Enable CMP3 output connect to timer 1 brake input</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP3_INT_EN</name>
              <description>Enable CMP3 output interrupt</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP2_TO_IO</name>
              <description>The CMP2 push-pull output is internally connected to the IO function</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP1_TO_IO</name>
              <description>The CMP1 push-pull output is internally connected to the IO function</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP3_CAP</name>
              <description>CMP3 compares the output of the 4 channels internally connected to TIMER2</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMP3_CFGR</name>
          <displayName>CMP3_CFGR</displayName>
          <description>CMP3 configur register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000007E</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>CMP3 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>PSEL</name>
              <description>CMP3 positive channel selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>NSEL</name>
              <description>CMP3 nagetive channel selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>HYS</name>
              <description>CMP3 hysteresis voltage selection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>RMID_EN</name>
              <description>CMP3 virtual center point was enabled</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>			
            <field>
              <name>DACDAT</name>
              <description>CMP3 module DAC output selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
			  <access>read-write</access>
            </field>			
            <field>
              <name>OEN</name>
              <description>enable CMP3 analog output to IO</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>			
            <field>
              <name>OE</name>
              <description>IO output is enabled when CMP3 push-pull output is connected to IO</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>			
            <field>
              <name>MODE_IOSEL</name>
              <description>pin selection when CMP3 push-pull output is connected to IO</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMP3_SW</name>
          <displayName>CMP3_SW</displayName>
          <description>CMP3 switch register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH_NUM</name>
              <description>CMP3 channel number of TIM2 channels to switch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>OUT_POL_CH1</name>
              <description>the first channel to compare the output
			  polarity configuration bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>OUT_POL_CH2</name>
              <description>the comparison output
			  polarity configuration bit for the second channel</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>OUT_POL_CH3</name>
              <description>the comparison output
			  polarity configuration bit for the third channel</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>OUT_POL_CH4</name>
              <description>the comparison output
			  polarity configuration bit for the channel 4</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMP_STATR</name>
          <displayName>CMP_STATR</displayName>
          <description>CMP state register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP1_OUT</name>
              <description>Turn off the output of CMP1 filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>CMP1_OUT_FILT</name>
              <description>Open the output of CMP1 filter</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>CMP2_OUT</name>
              <description>Turn off the output of CMP2 filter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>CMP2_OUT_FILT</name>
              <description>Open the output of CMP2 filter</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>CMP2_COMIF</name>
              <description>The CMP2 output is a high level interrupt flag bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>			
            <field>
              <name>CMP3_OUT</name>
              <description>Turn off the output of CMP3 filter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>CMP3_OUT_FILT</name>
              <description>Open the output of CMP3 filter</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>			
            <field>
              <name>CMP3_CHOUT0</name>
              <description>CMP3 channel switch the comparison output of the channel 0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>			
            <field>
              <name>CMP3_CHOUT1</name>
              <description>CMP3 channel switch the comparison output of the first channel</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP3_CHOUT2</name>
              <description>CMP3 channel switch the comparison output of the second channel</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CMP3_CHOUT3</name>
              <description>CMP3 channel switch the comparison output of the third channel</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>		
		</registers>
	</peripheral>		
	</peripherals>
 </device>
